#include <stdio.h>
#include <math.h> 
int main() {
int a, b ;
float c;
do {
 printf("\n Введіть значення a=");
 scanf("%d", &a);
 printf("\n Введіть значення b=");
 scanf("%d", &b);
 if (a == 0) {
 printf("Помилка: а дорівнює нулю. Введіть інше значення a\n");} 
 else if (a < 0){
 printf("Помилка: a менше нуля. Введіть інше значення a\n");}
 else if (b == a){
 printf("\n Помилка: a не може бути рівним b. Введіть інше значення \n");}
 else if (a < 2*b){
 printf("\n Помилка: a не повино бути меншим за 2*b. Введіть інше значення \n");}
 else if (b == 2*a){
 printf("\n Помилка: b не може бути рівним 2*a. Введіть інше значення \n");}
 else {  // Обчислення значення функції
 c=((2*a-b)*(2*b+a))/(sqrt(a-2*b)+2*b);
 printf("\n Значення функції c=%f", c);
 break; // Вихід з циклу при коректних значеннях
 } }
 while (1); // Безкінечний цикл, щоб повторювати введення, поки не будуть задані коректні значення
 return 0;
}